/**
 * 자바스크립트는 객체 기반의 프로그래밍 언어이며 자바스크립트를 구성하는 거의 모든 것이 객체다 원시 값을 제외한 나머지 값(함수,배열,정규표현식 등)은 모두 객체다
 * 
 * 원시 타입은 단 하나의 단위로 구성한 복합적이 자료구조다 또한 원시타입의 값 즉 원시 값은 변경 불가능한 값이지만 객체 타입의 값 즉 객체는 변경 가능한 값이다 이에 대해서는 객체는 0개이상의 프로퍼티로 구성된 집합이며 프로퍼티는 키와 값으로 구성된다
 * 
 * 자바스크립트에서 사용할 수 있는 모든 값은 프로퍼티 값이 될 수 있다. 자바스크립트의 함수는 일급 객체이므로 값으로 취급할 수 있다. 따라서 함수도 프로퍼티 값으로 사용 할 수 있다 프로퍼티 값이 함수일 경우 일반 함수와 구분하기 위해 메서드라 부른다.
 * 
 * 
 */

/**
 * 객체와 함수
 * 
 * 자바스크립트의 객체는 함수와 밀접한 관계를 가진다. 함수로 객체를 생성하기도 하며 함수 자체가 객체이기도 하다. 자바스크립트에서 함수와 객체는 분리해서 생각할 수 없는 개념이다. 즉, 객체를 이해해야 함수를 제대로 이해할 수 있고, 반대로 함수를 이해해야 객체를 정확히 이해할 수 있다.
 * 
 * 
 * 
 * 따라서 객체와 함수를 분리해서 설명하는 것은 옳지 않지만 책의 구성상 객체와 함수를 번갈아 가며 설명하고자 한다. 프로그래밍 언어 자체에는 순서가 없고 서로 물고 물리는 순환 구조가 있어서 잘이해되지않는 개념이 나오면 멈추지말고 일단은 다음으로 넘어가는것도 한가지 방법이다 가급적 상위 개념을 먼저 살펴보고 이를 기반으로 좀 더 복잡한 개념을 살펴보기로 하자
 */

